Practical 1: Configure Routers for Syslog, NTP and SSH operation.

Objectives:
1. Configure OSPF MD5 authentication.
2. Configure NTP.
3. Configure routers to log messages to the syslog server.
4. Configure R3 to support SSH connections.


			PART 1: CONFIGURE ROUTER 

Step 1: Configure password for vty lines
(Execute Command on all routers)
R(config) #line vty 0 4
R(config-line) #password vtypa55
R(config-line) #login 

Step 2: Configure secret on router
Execute Command on all routers
R(config) # enable secret enpa55

Step 3: Configure OSPF on routers
R1(config) #router ospf 1
R1(config-router) #network 192.168.1.0 0.0.0.255 area 0
R1(config-router) #network 10.1.1.0 0.0.0.3 area 0

R2(config) #router ospf 1
R2(config-router) #network 10.1.1.0 0.0.0.3 area 0
R2(config-router) #network 10.2.2.0 0.0.0.3 area 0

R3(config) #router ospf 1
R3(config-router) #network 192.168.3.0 0.0.0.255 area 0
R3(config-router) #network 10.2.2.0 0.0.0.3 area 0

Step 4: Test Connectivity
PC-A > ping 192.168.3.5
Successful
PC-B > ping 192.168.3.5
Successful

			PART 2: CONFIGURE OSPF MD5 Authentication

Step 1: Configure OSPF MD5 authentication for all the routers in area 0. (Execute Command on all routers)
R(config)# router ospf 1
R(config-router)# area 0 authentication message-digest

Step 2: Configure the MD5 key for all the routers in area.
R1(config)# int se0/1/0
R1(config-if)# ip ospf message-digest-key 1 md5 MD5pa55

R2(config)# int se0/1/0
R2(config-if)# ip ospf message-digest-key 1 md5 MD5pa55
R2(config-if)# int se0/1/1
R2(config-if)# ip ospf message-digest-key 1 md5 MD5pa55

R3(config)# int se0/1/0
R3(config-if)# ip ospf message-digest-key 1 md5 MD5pa55

Step 3: Verify configurations.
(Execute Command on all routers)
R# show ip ospf interface
Message-digest Authentication Enabled
Youngest key ID is 1

			PART 3: CONFIGURE NTP 

Step 1: Enable NTP authentication on PC-A.
a. On PC-A, click NTP under the Services tab to verify NTP service is enabled.
b. To configure NTP authentication, click Enable under Authentication. Use key 1 and password NTPpa55
for authentication.

Step 2: Configure Routers as NTP clients.
(Execute Command on all routers)
R(config)# ntp server 192.168.1.5

Step 3: Configure routers to update hardware clock.
(Execute Command on all routers)
R(config)# ntp update-calendar

Step 4: Verify that the hardware Clock.
R# show clock

Step 5: Configure NTP authentication on the routers.
(Execute Command on all routers)
R(config)# ntp authenticate
R(config)# ntp trusted-key 1
R(config)# ntp authentication-key 1 md5 NTPpa55

Step 6: Configure routers to timestamp log messages.
(Execute commands on all routers)
R(config)# service timestamps log datetime msec

			PART 4: CONFIGURE ROUTERS TO LOG MESSAGE TO THE SYSLOG SERVICE

Step 1: Configure the routers to identify the remote host (Syslog Server) that will receive logging messages.
(Execute Command on all routers)
R(config)# logging host 192.168.1.6
			
Step 2: Verify logging configuration.
(Execute Command on all routers)
R# show logging
O/P 2 message lines log 

Step 3: Examine logs of the Syslog Server.
In the services of syslog server select syslog service observe the logs above.

			
			Part 5: Configure R3 to Support SSH Connections

Step 1: Configure a domain name
R3(config)# ip domain-name ccnasecurity.com

Step 2: Configure users for login to the SSH server on R3.
R3(config)# username SSHadmin privilege 15 secret sshpa55

Step 3: Configure the incoming vty lines on R3.
R3(config)# line vty 0 4
R3(config-line)# login local
R3(config-line)# transport input ssh

Step 4: Erase existing key pairs on R3.
R3(config)# crypto key zeroize rsa

Step 5: Generate the RSA encryption key pair for R3.
R3(config)# crypto key generate rsa
How many bits in the modulus[512]:1024

Step 6: Verify the SSH configuration.
R3# show ip ssh
SSH enabled-version 1.99
Authentication time out: 120 secs; Authentication retries : 3
R3#

Step 7: Configure SSH timeouts and authentication parameters.
R3(config)# ip ssh time-out 90
R3(config)# ip ssh authentication-retries 2
R3(config)# ip ssh version 2

Step 8: Verify the SSH configuration
R3# show ip ssh
SSH enabled-version 2.0
Authentication time out: 90 secs; Authentication retries : 2
R3#

Step 9: Attempt to connect to R3 via Telnet from PC-C.
Open the Desktop of PC-C. Select the Command Prompt icon.
PC> telnet 192.168.3.1
(Unsuccessful)

Step 10: Connect to R3 using SSH on PC-C.
PC> ssh –l SSHadmin 192.168.3.1
Password: sshpa55
R3#

Step 11: Connect to R3 using SSH on R2.
R2# ssh –v 2 –l SSHadmin 10.2.2.1
Password: sshpa55
R3#












